{
  "valentines": [
    "you make my heart's matrix full rank",
    "may we never be linearly separable",
    "you're the activation function of my heart",
    "will you be my nearest neighbor?",
    "you look fine(-tuned)",
    "you give my heart a warm start",
    "i want to perform gradient descent into your arms",
    "your beauty makes me catastrophically forget my words when i see you",
    "is your name Adam?\nbecause you've optimized my heart's objective function",
    "did it hurt when you went through reverse diffusion? because you look like the SDXL output for \"my soulmate\"",
    "are you MNIST?\nbecause i'm trying to get your digits",
    "are you a GAN trained to convergence?\nbecause when i'm with you i can't tell fantasy from reality",
    "are you a pre-update PPO policy?\nbecause i always want to stay close to you",
    "roses are red\nviolets are blue\nwho needs flowers\nwhen you have a NVIDIA H100 Tensor Core GPU?",
    "you make me feel statistically significant",
    "are you a scheduler?\nbecause you make my heart rate go up",
    "my love for you has infinite horizon",
    "forget epsilon-greedy - i'm 100% committed to choosing you",
    "our relationship has no terminal state",
    "my policy gradient always points toward you",
    "my feelings for you are deeper than ResNet",
    "who needs experience replay when every moment with you is worth remembering in real-time?",
    "are you hierarchical RL?\nbecause you give purpose to all my actions",
    "i don't have to worry about sparse rewards when i'm with you, because every moment is meaningful",
    "you're the global optimum in my loss landscape",
    "are you a reward shaping function? because you make all the right things matter",
    "i can't .detach() my feelings for you from the computation graph",
    "are you using beam search? because you always find the right words to say",
    "my heart runs at 100% utilization when i'm with you",
    "they say love is blind, but my vision transformer has 12 attention heads just for you",
    "life without you is like a transformer without attention—i wouldn't know what matters",
    "my thoughts turn into a bag of words when i see you",
    "you're in my chain of thought",
    "are you a symmetric positive semi-definite matrix? because life can never be negative with you around",
    "are you a poorly conditioned matrix? because you are making my heart feel unstable",
    "are you a singular matrix? because nothing can invert my feelings for you",
    "are you attention? because you're all i need",
    "are we a NeRF? because we mesh well together",
    "i’m used to multi-head attention but today I only have eyes for you",
    "K and L might diverge, but U and I would never",
    "are you WandB? because you're the first thing i think about in the morning",
    "i can already Imagen you and i together",
    "my classifier has guided my diffusion process to you",
    "i don’t need trillions of tokens to learn that you’re the one for me",
    "i don’t need any reward models, i have a direct preference for you",
    "help me train this model to convergence; the loss function is your distance from me",
    "i'm learning about word embeddings:\n\"me\" + \"love\" = \"you\"",
    "i’d use my last tokens to tell you i love you",
    "my discriminator can’t tell the difference between you and the image of perfection",
    "forget Deepseek, i’m trying to seek a deep connection with you",
    "being without you is out of distribution for me",
    "are you an absorbing markov state? because i want to be with you forever",
    "can you be a binary classifier and help decide between your place or mine?",
    "the probability i love you is equivalent to the probability you love me times the the probability i love divided by the probability you love (bae’s theorem)",
    "you don’t need my parameters and weights to interpret my feelings for you",
    "are you an array of H100’s? because you’re looking like a million bucks",
    "no need for positional encodings, i already know you are at the center of my world",
    "i love when you respond to my texts with k, because k-means i'll be with you",
    "i don't need a process reward model because i already know i'll be good with you",
    "i've done some speculative decoding, and i see a bright future with me and you",
    "my heart is like a loss curve without gradient warmup - it spikes when i see you",
    "no amount of quantization can reduce the love i have for you",
    "i don't mind hallucination if it means i can dream about you",
    "if my heart were one‑hot encoded, you'd be my one nonzero entry",
    "our hearts are fully connected, no dropout when i’m with you",
    "keeping it A100, i love you",
    "are you overfitting? because you're too good to be true",
    "you're the o1 for me",
    "my AGI timeline is five years, but my timeline with you is forever"
  ]
}
